import React from 'react'
import '../css/oferta.css'

const Policy = () => {
  return (
    <div>
            <div id="publicofferta" className='public-offerta'>
        <div className='public-offerta-container mx-auto max-w-[1280px]'>
            <div className='public-offerta-wrapper'>
                <div className='public-offerta-top top row-span-2 items-start'>
                    <div className='public-offerta-title'>
                      <h2>
                      ПОЛІТИКА КОНФІДЕНЦІЙНОСТІ <br />
                      мобільного застосунку INDI
                      </h2>
                    </div>
                    <div className='public-offerta-sub-title'>
                        <span>Редакція від 12 лютого 2026 року</span>
                    </div>
                    <div className='public-offerta-text'>

                        <h3>
                            1. ЗАГАЛЬНІ ПОЛОЖЕННЯ
                        </h3>
                        <p>
                            Ця Політика конфіденційності визначає порядок збору, обробки, зберігання та захисту
                            персональних даних користувачів мобільного застосунку та/або веб-сайту INDI (далі —
                            «Сервіс»).
                        </p>
                        <p>
                            Оператором персональних даних є:
                            ФОП Гуменюк Роман Сергійович
                            ІПН 3475106273
                            Україна, м. Вінниця, вул. Келецька 110, кв. 51
                            Email: indiproductapp@gmail.com
                            Користуючись Сервісом, Ви підтверджуєте ознайомлення та згоду з цією Політикою.
                        </p>
                        <h3>
                            2. Які дані ми збираємо
                        </h3>
                        <h4>2.1. Дані, які Ви надаєте добровільно:</h4>
                        <ul>
                            <li>- електронна пошта (email)</li>
                            <li>- номер телефону</li>
                            <li>- ім’я (за наявності)</li>
                    
                        </ul>

                        <h4>2.2. Автоматично зібрані дані:</h4>
                        <ul>
                            <li>- IP-адреса</li>
                            <li>- тип пристрою</li>
                            <li>- модель пристрою</li>
                            <li>- операційна система</li>
                            <li>- унікальні ідентифікатори пристрою (Device ID, Firebase ID)</li>
                            <li>- мова системи</li>
                            <li>- час та дата використання</li>
                        </ul>
                        <h4>Дані використання (App Activity):</h4>
                        <ul>
                            <li> - перегляд карток</li>
                            <li> - активація пропозицій</li>
                            <li> - взаємодія з функціоналом</li>
                            <li> - аналітичні події</li>
                        </ul>
                        <h3>
                            3. Мета обробки персональних даних
                        </h3>

                        <h4>Ми обробляємо дані з метою:</h4>
                        <ul>
                            <li>- створення та підтримки облікового запису</li>
                            <li>- надання доступу до функціоналу</li>
                            <li>- надсилання push-повідомлень</li>
                            <li>- аналітики використання Сервісу</li>
                            <li>- покращення якості продукту</li>
                            <li>- запобігання шахрайству</li>
                            <li>- забезпечення безпеки</li>
                        </ul>


                        <h3>
                         4. Правові підстави обробки
                        </h3>
                       <p>Обробка персональних даних здійснюється на підставі добровільної згоди Користувача,
                        необхідності виконання умов користування та вимог чинного законодавства України.
                        </p>

                        <h3>
                            5. Передача даних третім сторонам
                        </h3>

                        <h4>Ми використовуємо сторонні сервіси:</h4>
                            <ul>
                                <li>- Google Firebase (інфраструктура, push-повідомлення, аналітика)</li>
                                <li>- Amplitude (аналітика поведінки користувачів)</li> 
                            </ul>
                        <p>
                            Ці сервіси можуть обробляти технічні та аналітичні дані відповідно до власних політик
                            конфіденційності.
                        </p>
                        <p>
                            Ми не продаємо, не обмінюємо та не передаємо персональні дані користувачів третім
                            особам з метою отримання комерційної вигоди
                        </p>
                        <p>
                            5.1. У Сервісі можуть використовуватись бали, статуси або рівні.
                        </p>
                        <h4>Передача даних може здійснюватися виключно:</h4>
                        <ul>
                            <li>- для забезпечення роботи технічної інфраструктури Сервісу;</li>
                            <li>- у випадках, прямо передбачених законодавством;</li>
                            <li>- за окремою згодою користувача.</li>
                        </ul>
                        <p>
                            Передача даних органам державної влади здійснюється лише у випадках, передбачених
                            законодавством.
                        </p>

                        <h3>6. Push-повідомлення</h3>
                        <p>
                            Ми можемо надсилати інформаційні та маркетингові повідомлення.
                            Користувач може вимкнути push-повідомлення у налаштуваннях пристрою.
                        </p>
                        <h3>7. Зберігання даних</h3>
                        <p>
                            Персональні дані зберігаються протягом періоду користування Сервісом або до моменту
                            отримання запиту на видалення.
                        </p>
                        <h3>8. Захист персональних даних</h3>
                        <p>
                            Ми застосовуємо технічні та організаційні заходи для захисту персональних даних,
                            включаючи шифрування передачі даних (HTTPS) та обмеження доступу.
                        </p>
                        <h3>9. Права користувача</h3>
                        <p>
                            Користувач має право отримати інформацію про свої дані, вимагати їх виправлення або
                            видалення, а також відкликати згоду на обробку.
                        </p>
                        <p>Запит можна направити на email: indiproductapp@gmail.com

                        </p>
                        <h3>10. Видалення акаунту</h3>
                        <p>
                            Після підтвердження запиту персональні дані видаляються або анонімізуються, за винятком
                            випадків, передбачених законом.
                        </p>
                        <h3>11. Дані дітей</h3>
                        <p>
                            Сервіс не призначений для використання дітьми віком до 18 років.
                        </p>

                        <h3>12. Міжнародна передача даних</h3>
                        <p>
                           У зв’язку з використанням міжнародних сервісів (Google Firebase, Amplitude) дані можуть
передаватися за межі України відповідно до стандартів захисту даних таких сервісів.
                        </p>
                        <h3>13. Зміни до Політики</h3>
                        <p>
                           Ми можемо оновлювати цю Політику. Актуальна редакція завжди доступна в Сервісі або на
                            веб-сайті.
                        </p>
                        
                      <div className='oferta-link'>
                        <p>
                         <a href={`${import.meta.env.BASE_URL}PrivacyPolicy.pdf`} target="_blank">Завантажити Політику конфіденційності </a>
                        </p>
                      </div>
                    </div>
                </div>
            </div>
        </div>
    </div>
    </div>
  )
}

export default Policy