import React from 'react'
import '../css/oferta.css'
const Publicofferta = () => {
  return (
    <div id="publicofferta" className='public-offerta'>
        <div className='public-offerta-container mx-auto max-w-[1280px]'>
            <div className='public-offerta-wrapper'>
                <div className='public-offerta-top top row-span-2 items-start'>
                    <div className='public-offerta-title'>
                      <h2>
                        ПУБЛІЧНИЙ ДОГОВІР-ОФЕРТА<br />
                        про надання доступу до цифрового сервісу INDI.
                      </h2>
                    </div>
                    <div className='public-offerta-sub-title'>
                        <span>Редакція від 12 лютого 2026 року</span>
                    </div>
                    <div className='public-offerta-text'>
                        <p>
                            ФОП Гуменюк Роман Сергійович, ІПН 3475106273 зареєстрований відповідно до
                            законодавства України (надалі – «Оператор»), з однієї сторони, та фізична особа, яка
                            здійснила реєстрацію у цифровому сервісі INDI (надалі – «Користувач»), з іншої сторони,
                            разом – «Сторони», уклали цей Договір про наступне:
                        </p>
                        <h3>
                            1. ЗАГАЛЬНІ ПОЛОЖЕННЯ
                        </h3>
                        <p>
                            1.1. Цей Договір є публічним договором відповідно до ст. 633, 634, 641, 642 Цивільного
                            кодексу України
                        </p>
                        <p>
                           1.2. Договір встановлює однакові для всіх Користувачів умови доступу до сервісу INDI
                        </p>
                        <p>
                            1.3. Сервіс INDI є цифровою інформаційно-маркетинговою платформою, яка забезпечує
                            доступ до пропозицій Партнерів
                        </p>
                        <p>
                            1.4. Оператор не є продавцем товарів або надавачем послуг Партнерів
                        </p>
                        <p>
                           1.5. Договір є обов’язковим для Оператора з моменту його оприлюднення на веб-сайті або в
                           мобільному застосунку
                        </p>
                        <h3>
                            2. АКЦЕПТ ДОГОВОРУ
                        </h3>
                        <p>
                           2.1. Договір вважається укладеним з моменту реєстрації Користувача або фактичного
                           початку використання Сервісу.
                        </p>
                        <p>
                          2.2. Реєстрація, авторизація або використання функціоналу означає повний та безумовний
                          акцепт.
                        </p>
                        <p>
                            2.3. Користувач підтверджує, що він ознайомився з умовами цього Договору та погоджується з
                            ними
                        </p>
                        <p>
                            2.3. Якщо Користувач не згоден з умовами — він зобов’язаний припинити використання
                            Сервісу.
                        </p>
                        <h3>
                            3. ПРЕДМЕТ ДОГОВОРУ
                        </h3>
                        <p>
                            3.1. Оператор надає Користувачу невиключне право користування функціоналом Сервісу.
                        </p>
                        <p>
                            3.2. Сервіс забезпечує доступ до цифрових карток зі знижками або спеціальними умовами
                            Партнерів.
                        </p>
                        <p>
                            3.3. Договір купівлі товарів або послуг укладається виключно між Користувачем та
                            Партнером.
                        </p>
                        <p>
                            3.4. Оператор не несе відповідальності за якість товарів/послуг Партнерів.
                        </p>
                        <p>
                            3.5. Оператор не відповідає за збитки, прямі чи непрямі, що виникли внаслідок
                            використання або неможливості використання Сервісу.
                        </p>
                        <h3>
                          4. ПОРЯДОК КОРИСТУВАННЯ
                        </h3>
                        <h4>4.1. Користувач зобов’язаний:</h4>
                        <ul>
                            <li>- надавати достовірні дані;</li>
                            <li>- не створювати множинні акаунти;</li>
                            <li>- не використовувати автоматизовані інструменти;</li>
                            <li>- не зловживати механікою знижок.</li>
                        </ul>
                             <h4>4.2. Користувач має право:</h4>
                        <ul>
                            <li>- обмежити або заблокувати акаунт;</li>
                            <li>- припинити доступ у разі порушення умов</li>
                            <li>- змінювати функціонал сервісу</li>
                           
                        </ul>
                        <h3>
                            5.ВНУТРІШНІ БАЛИ ТА ГЕЙМІФІКАЦІЯ
                        </h3>
                        <p>
                            5.1. У Сервісі можуть використовуватись бали, статуси або рівні.
                        </p>
                        <h4>5.2  Вони :</h4>
                        <ul>
                            <li>- не є грошима;</li>
                            <li>- не є електронними коштами;</li>
                            <li>- не підлягають обміну або компенсації.</li>
                           
                        </ul>
                        <h3>
                            6. 6. ВАРТІСТЬ ТА РОЗРАХУНКИ
                        </h3>
                        <p>
                            6.1. Доступ до Сервісу може бути безкоштовним або платним.
                        </p>
                        <p>6.2. У разі запровадження платних функцій умови оплати визначаються окремо.

                        </p>
                        <p>6.3. В період Бета-режиму можливі компенсаційні механізми

                        </p>
                        <h3>
                            7. ОБМЕЖЕННЯ ВІДПОВІДАЛЬНОСТІ
                        </h3>

                        <p>
                            7.1. Сервіс надається «як є».
                        </p>
                       <h4>7.2  Оператор не несе відповідальності за:</h4>
                        <ul>
                            <li>- дії Партнерів;</li>
                            <li>- втрачений прибуток;</li>
                            <li>- непрямі збитки;</li>
                            <li>- тимчасову недоступність сервісу.</li>
                        </ul>
                        <p>
                            7.3. Сукупна відповідальність Оператора обмежується фактично сплаченими коштами.
                        </p>
                        <h3>
                            8. ПЕРСОНАЛЬНІ ДАНІ
                        </h3>
                        <p>
                            8.1. Обробка персональних даних здійснюється відповідно до Закону України «Про захист
персональних даних» та окремої Політики конфіденційності.
                        </p>
                         <h4>8.2 Оператор може обробляти:</h4>
                        <ul>
                            <li>- email;</li>
                            <li>- втрачений прибуток;</li>
                            <li>- номер телефону;</li>
                            <li>- технічні дані пристрою;</li>
                            <li>- аналітичні дані.</li>
                        </ul>
                        <p>
                            8.3. Користувач має всі права, передбачені законодавством
                        </p>
                        <h3>
                            9. КОНФІДЕНЦІЙНІСТЬ
                        </h3>
                        <p>
                            9.1. Оператор забезпечує конфіденційність отриманої інформації
                        </p>
                        <p>
                            9.2. Дані можуть передаватися органам влади лише у випадках, передбачених законом.
                        </p>
                        <h3>
                            10. ФОРС-МАЖОР
                        </h3>
                        <p>
                            10.1. Сторони звільняються від відповідальності у разі виникнення обставин непереборної
                            сили (війна, кібератаки, перебої електропостачання тощо).
                        </p>
                        <h3>
                            11. ПОРЯДОК ВИРІШЕННЯ СПОРІВ
                        </h3>
                        <p>
                            11.1. Спори вирішуються шляхом переговорів.
                        </p>
                        <p>
                            11.2. У разі недосягнення згоди — в судовому порядку відповідно до законодавства України.
                        </p>
                        <h3>
                            12. ВНЕСЕННЯ ЗМІН
                        </h3>
                        <p>
                            12.1. Оператор має право змінювати умови Договору.
                        </p>
                      
                        <p>
                           12.2. Нова редакція набирає чинності з моменту публікації.
                        </p>
                         <p>
                            12.3. Продовження користування означає згоду зі змінами                        </p>
                        <h3>
                            13. 13. СТРОК ДІЇ
                        </h3>
                        <p>
                         13.1. Договір діє безстроково з моменту акцепту.
                        </p>
                        <p>
                            13.2. Користувач може припинити використання шляхом видалення акаунта.                    
                        </p>
                      <h3>
                        14. РЕКВІЗИТИ ОПЕРАТОРА
                      </h3>
                      <p>
                        ФОП Гуменюк Роман Сергійович,
                        ІПН 3475106273,
                        Адреса: Україна, м.Вінниця, вул. Келецька 110, кв. 51
                        Email: indiproductapp@gmail.com
                      </p>
                      <div className='oferta-link'>
                        <p>
                         <a href={`${import.meta.env.BASE_URL}finalpublicoffer.pdf`} target="_blank" >Завантажити договір публічної оферти </a>
                        </p>
                      </div>
                    </div>
                </div>
            </div>
        </div>
    </div>
  )
}

export default Publicofferta